#### [`repos`] Terraform Plan 📖`success`



<details><summary>Show Plan</summary>

```tf
data.github_team.cdktn-team-cdk-terrain: Reading...
data.github_team.cdktn-team-cdk-terrain: Read complete after 3s [id=15746607]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.cdktn-provider-acme_repo_secret-alert-prs-slack-webhook-url_9709DD49 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-acme_repo_secret-alert-prs-slack-webhook-url_9709DD49" {
      ~ created_at       = "2026-02-19 07:55:42 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-acme:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-02-19 07:55:42 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-gh-app-id-alias-PROJEN_APP_ID_233BB8DE must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-acme_repo_secret-gh-app-id-alias-PROJEN_APP_ID_233BB8DE" {
      ~ created_at       = "2026-02-19 07:55:52 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-acme:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-19 07:55:52 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-gh-app-id_437FD786 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-acme_repo_secret-gh-app-id_437FD786" {
      ~ created_at       = "2026-02-19 07:55:48 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-acme:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-19 07:55:48 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_7F529563 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-acme_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_7F529563" {
      ~ created_at       = "2026-02-19 07:55:46 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-acme:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-19 07:55:46 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-gh-app-private-key_2BB1FBE8 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-acme_repo_secret-gh-app-private-key_2BB1FBE8" {
      ~ created_at       = "2026-02-19 07:55:43 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-acme:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-19 07:55:43 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_9685A7C9 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-acme_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_9685A7C9" {
      ~ created_at       = "2026-02-19 07:56:00 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-acme:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 07:56:00 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_BD15C069 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-acme_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_BD15C069" {
      ~ created_at       = "2026-02-19 07:55:40 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-acme:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 07:55:40 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-gh-token_6FA75225 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-acme_repo_secret-gh-token_6FA75225" {
      ~ created_at       = "2026-02-19 07:55:51 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-acme:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 07:55:51 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-npm-token_EC270559 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-acme_repo_secret-npm-token_EC270559" {
      ~ created_at       = "2026-02-19 07:56:01 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-acme:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 07:56:01 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-twine-password_8CC998B9 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-acme_repo_secret-twine-password_8CC998B9" {
      ~ created_at       = "2026-02-19 07:55:39 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-acme:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-19 07:55:39 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-twine-username_D7BB97BB must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-acme_repo_secret-twine-username_D7BB97BB" {
      ~ created_at       = "2026-02-19 07:55:58 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-acme:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-02-19 07:55:58 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-alert-prs-slack-webhook-url_3EAA76B3 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-alert-prs-slack-webhook-url_3EAA76B3" {
      ~ created_at       = "2026-01-11 15:25:09 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:09 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-gh-app-id-alias-PROJEN_APP_ID_42567B52 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-gh-app-id-alias-PROJEN_APP_ID_42567B52" {
      ~ created_at       = "2026-01-11 15:25:17 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:17 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-gh-app-id_B21F6EA0 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-gh-app-id_B21F6EA0" {
      ~ created_at       = "2026-01-11 15:25:22 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:22 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_5B0D44DC must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_5B0D44DC" {
      ~ created_at       = "2026-01-11 15:25:43 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:43 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-gh-app-private-key_1B91EF11 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-gh-app-private-key_1B91EF11" {
      ~ created_at       = "2026-01-11 15:25:20 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:20 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_044A657A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_044A657A" {
      ~ created_at       = "2026-02-18 05:00:53 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:00:53 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5CD9DE70 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5CD9DE70" {
      ~ created_at       = "2026-02-18 05:00:59 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:00:59 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-gh-token_BCE9E69C must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-gh-token_BCE9E69C" {
      ~ created_at       = "2026-02-18 05:00:52 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:00:52 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-npm-token_9A435341 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-npm-token_9A435341" {
      ~ created_at       = "2026-02-08 02:51:42 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:51:42 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-twine-password_F0BBCEF9 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-twine-password_F0BBCEF9" {
      ~ created_at       = "2026-02-02 17:51:30 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-02 17:51:30 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-twine-username_3FB41B86 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-twine-username_3FB41B86" {
      ~ created_at       = "2026-01-11 15:25:28 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:28 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-alert-prs-slack-webhook-url_1F4B3133 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-alert-prs-slack-webhook-url_1F4B3133" {
      ~ created_at       = "2026-01-16 03:57:45 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:45 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-gh-app-id-alias-PROJEN_APP_ID_248425AD must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-gh-app-id-alias-PROJEN_APP_ID_248425AD" {
      ~ created_at       = "2026-01-16 03:57:24 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:24 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-gh-app-id_5C1C3B0A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-gh-app-id_5C1C3B0A" {
      ~ created_at       = "2026-01-16 03:57:20 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:20 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_D6EBC20D must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_D6EBC20D" {
      ~ created_at       = "2026-01-16 03:57:43 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:43 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-gh-app-private-key_F82B911E must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-gh-app-private-key_F82B911E" {
      ~ created_at       = "2026-01-16 03:57:37 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:37 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_BE1C067A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_BE1C067A" {
      ~ created_at       = "2026-02-18 05:01:50 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:01:50 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_EF4EA2F2 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_EF4EA2F2" {
      ~ created_at       = "2026-02-18 05:01:52 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:01:52 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-gh-token_4B61A244 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-gh-token_4B61A244" {
      ~ created_at       = "2026-02-18 05:01:43 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:01:43 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-npm-token_8361EB4A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-npm-token_8361EB4A" {
      ~ created_at       = "2026-02-08 02:51:48 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:51:48 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-twine-password_8580036B must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-twine-password_8580036B" {
      ~ created_at       = "2026-02-02 17:51:28 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-02 17:51:28 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-twine-username_917EFB10 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-twine-username_917EFB10" {
      ~ created_at       = "2026-01-16 03:57:31 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:31 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-alert-prs-slack-webhook-url_323EFE9C must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-alert-prs-slack-webhook-url_323EFE9C" {
      ~ created_at       = "2026-02-19 01:50:15 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azuread:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-02-19 01:50:15 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-gh-app-id-alias-PROJEN_APP_ID_DFD07133 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-gh-app-id-alias-PROJEN_APP_ID_DFD07133" {
      ~ created_at       = "2026-02-19 01:49:59 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azuread:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-19 01:49:59 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-gh-app-id_B2B5D65A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-gh-app-id_B2B5D65A" {
      ~ created_at       = "2026-02-19 01:50:09 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azuread:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-19 01:50:09 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_9715E4A7 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_9715E4A7" {
      ~ created_at       = "2026-02-19 01:50:12 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azuread:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-19 01:50:12 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-gh-app-private-key_F5C891A4 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-gh-app-private-key_F5C891A4" {
      ~ created_at       = "2026-02-19 01:50:06 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azuread:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-19 01:50:06 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_13F040FC must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_13F040FC" {
      ~ created_at       = "2026-02-19 01:49:53 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azuread:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 01:49:53 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_8B20B4DD must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_8B20B4DD" {
      ~ created_at       = "2026-02-19 01:50:11 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azuread:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 01:50:11 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-gh-token_07E6F8B2 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-gh-token_07E6F8B2" {
      ~ created_at       = "2026-02-19 01:49:56 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azuread:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 01:49:56 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-npm-token_2F8F7884 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-npm-token_2F8F7884" {
      ~ created_at       = "2026-02-19 01:49:52 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azuread:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 01:49:52 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-twine-password_D210EC70 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-twine-password_D210EC70" {
      ~ created_at       = "2026-02-19 01:49:58 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azuread:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-19 01:49:58 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-twine-username_2177FAE1 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-twine-username_2177FAE1" {
      ~ created_at       = "2026-02-19 01:49:50 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azuread:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-02-19 01:49:50 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-alert-prs-slack-webhook-url_3DEE0CCC must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-alert-prs-slack-webhook-url_3DEE0CCC" {
      ~ created_at       = "2026-02-07 11:10:43 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:43 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-id-alias-PROJEN_APP_ID_03A7C388 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-id-alias-PROJEN_APP_ID_03A7C388" {
      ~ created_at       = "2026-02-07 11:10:39 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:39 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-id_F3F7DE54 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-id_F3F7DE54" {
      ~ created_at       = "2026-02-07 11:10:42 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:42 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_B467195A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_B467195A" {
      ~ created_at       = "2026-02-07 11:10:41 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:41 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-private-key_728C9E43 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-private-key_728C9E43" {
      ~ created_at       = "2026-02-07 11:10:48 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:48 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_23459056 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_23459056" {
      ~ created_at       = "2026-02-18 05:02:15 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:02:15 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_34157FC4 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_34157FC4" {
      ~ created_at       = "2026-02-18 05:02:18 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:02:18 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-token_990262B8 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-token_990262B8" {
      ~ created_at       = "2026-02-18 05:02:16 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:02:16 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-npm-token_CBEF1300 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-npm-token_CBEF1300" {
      ~ created_at       = "2026-02-08 02:51:43 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:51:43 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-twine-password_F9423D0A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-twine-password_F9423D0A" {
      ~ created_at       = "2026-02-07 11:10:37 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:37 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-twine-username_087C8662 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-twine-username_087C8662" {
      ~ created_at       = "2026-02-07 11:10:54 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:54 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-alert-prs-slack-webhook-url_60417453 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-alert-prs-slack-webhook-url_60417453" {
      ~ created_at       = "2026-02-19 02:43:22 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudflare:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-02-19 02:43:22 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-gh-app-id-alias-PROJEN_APP_ID_81000AFB must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-gh-app-id-alias-PROJEN_APP_ID_81000AFB" {
      ~ created_at       = "2026-02-19 02:43:15 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudflare:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-19 02:43:15 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-gh-app-id_C2EE870D must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-gh-app-id_C2EE870D" {
      ~ created_at       = "2026-02-19 02:43:00 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudflare:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-19 02:43:00 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_C1931664 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_C1931664" {
      ~ created_at       = "2026-02-19 02:43:06 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudflare:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-19 02:43:06 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-gh-app-private-key_C155F96A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-gh-app-private-key_C155F96A" {
      ~ created_at       = "2026-02-19 02:43:03 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudflare:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-19 02:43:03 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_21A9DBA9 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_21A9DBA9" {
      ~ created_at       = "2026-02-19 02:43:04 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudflare:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 02:43:04 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F7495BBA must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F7495BBA" {
      ~ created_at       = "2026-02-19 02:43:23 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudflare:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 02:43:23 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-gh-token_D9BA6B0C must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-gh-token_D9BA6B0C" {
      ~ created_at       = "2026-02-19 02:43:11 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudflare:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 02:43:11 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-npm-token_6880ECE4 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-npm-token_6880ECE4" {
      ~ created_at       = "2026-02-19 02:43:12 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudflare:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 02:43:12 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-twine-password_39ABFA38 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-twine-password_39ABFA38" {
      ~ created_at       = "2026-02-19 02:43:07 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudflare:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-19 02:43:07 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-twine-username_44DC4E94 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-twine-username_44DC4E94" {
      ~ created_at       = "2026-02-19 02:43:21 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudflare:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-02-19 02:43:21 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-alert-prs-slack-webhook-url_2D5F82FA must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-alert-prs-slack-webhook-url_2D5F82FA" {
      ~ created_at       = "2026-01-11 15:25:06 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:06 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-app-id-alias-PROJEN_APP_ID_2B2FE55F must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-gh-app-id-alias-PROJEN_APP_ID_2B2FE55F" {
      ~ created_at       = "2026-01-11 15:24:57 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:24:57 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-app-id_FC609807 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-gh-app-id_FC609807" {
      ~ created_at       = "2026-01-11 15:24:29 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:24:29 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_79D9AAB4 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_79D9AAB4" {
      ~ created_at       = "2026-01-11 15:25:01 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:01 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-app-private-key_C9777824 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-gh-app-private-key_C9777824" {
      ~ created_at       = "2026-01-11 15:25:00 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:00 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_B09BA867 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_B09BA867" {
      ~ created_at       = "2026-02-18 05:01:18 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:01:18 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6E439A90 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6E439A90" {
      ~ created_at       = "2026-02-18 05:01:15 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:01:15 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-token_6C4D33CF must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-gh-token_6C4D33CF" {
      ~ created_at       = "2026-02-18 05:01:16 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:01:16 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-npm-token_652B547F must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-npm-token_652B547F" {
      ~ created_at       = "2026-02-08 02:52:01 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:52:01 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-twine-password_95C843B1 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-twine-password_95C843B1" {
      ~ created_at       = "2026-02-02 17:51:31 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-02 17:51:31 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-twine-username_B3F38BF0 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-twine-username_B3F38BF0" {
      ~ created_at       = "2026-01-11 15:24:58 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:24:58 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-alert-prs-slack-webhook-url_1FDA742A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-alert-prs-slack-webhook-url_1FDA742A" {
      ~ created_at       = "2026-02-21 16:32:01 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-databricks:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-02-21 16:32:01 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-gh-app-id-alias-PROJEN_APP_ID_683EBB2D must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-gh-app-id-alias-PROJEN_APP_ID_683EBB2D" {
      ~ created_at       = "2026-02-21 16:31:56 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-databricks:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-21 16:31:56 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-gh-app-id_8ED187A2 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-gh-app-id_8ED187A2" {
      ~ created_at       = "2026-02-21 16:32:02 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-databricks:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-21 16:32:02 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_62A242B4 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_62A242B4" {
      ~ created_at       = "2026-02-21 16:31:55 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-databricks:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-21 16:31:55 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-gh-app-private-key_2BB4DA8C must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-gh-app-private-key_2BB4DA8C" {
      ~ created_at       = "2026-02-21 16:31:52 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-databricks:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-21 16:31:52 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_E143B310 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_E143B310" {
      ~ created_at       = "2026-02-21 16:32:12 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-databricks:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-21 16:32:12 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_FFBB0ECB must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_FFBB0ECB" {
      ~ created_at       = "2026-02-21 16:32:11 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-databricks:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-21 16:32:11 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-gh-token_56B39598 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-gh-token_56B39598" {
      ~ created_at       = "2026-02-21 16:32:14 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-databricks:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-21 16:32:14 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-npm-token_2265B02E must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-npm-token_2265B02E" {
      ~ created_at       = "2026-02-21 16:32:16 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-databricks:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-21 16:32:16 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-twine-password_D8A1524C must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-twine-password_D8A1524C" {
      ~ created_at       = "2026-02-21 16:32:15 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-databricks:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-21 16:32:15 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-twine-username_ED68300D must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-twine-username_ED68300D" {
      ~ created_at       = "2026-02-21 16:31:54 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-databricks:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-02-21 16:31:54 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-alert-prs-slack-webhook-url_81931217 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-alert-prs-slack-webhook-url_81931217" {
      ~ created_at       = "2026-02-19 19:42:52 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-datadog:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-02-19 19:42:52 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-gh-app-id-alias-PROJEN_APP_ID_134A1370 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-gh-app-id-alias-PROJEN_APP_ID_134A1370" {
      ~ created_at       = "2026-02-19 19:43:06 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-datadog:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-19 19:43:06 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-gh-app-id_81D8C3B7 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-gh-app-id_81D8C3B7" {
      ~ created_at       = "2026-02-19 19:43:04 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-datadog:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-19 19:43:04 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_B2B87BE2 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_B2B87BE2" {
      ~ created_at       = "2026-02-19 19:42:53 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-datadog:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-19 19:42:53 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-gh-app-private-key_32146EB6 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-gh-app-private-key_32146EB6" {
      ~ created_at       = "2026-02-19 19:43:09 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-datadog:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-19 19:43:09 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_843EBC76 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_843EBC76" {
      ~ created_at       = "2026-02-19 19:42:46 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-datadog:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 19:42:46 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_D2FADACA must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_D2FADACA" {
      ~ created_at       = "2026-02-19 19:42:47 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-datadog:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 19:42:47 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-gh-token_37789FAE must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-gh-token_37789FAE" {
      ~ created_at       = "2026-02-19 19:43:08 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-datadog:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 19:43:08 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-npm-token_3F71B28A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-npm-token_3F71B28A" {
      ~ created_at       = "2026-02-19 19:42:49 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-datadog:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-19 19:42:49 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-twine-password_70452E7A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-twine-password_70452E7A" {
      ~ created_at       = "2026-02-19 19:42:48 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-datadog:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-19 19:42:48 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-twine-username_C1D80EB7 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-twine-username_C1D80EB7" {
      ~ created_at       = "2026-02-19 19:42:56 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-datadog:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-02-19 19:42:56 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-alert-prs-slack-webhook-url_7F1B7484 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-alert-prs-slack-webhook-url_7F1B7484" {
      ~ created_at       = "2026-01-11 15:27:24 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:27:24 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-gh-app-id-alias-PROJEN_APP_ID_6C6CBFC6 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-gh-app-id-alias-PROJEN_APP_ID_6C6CBFC6" {
      ~ created_at       = "2026-01-11 15:26:47 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:26:47 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-gh-app-id_D56D9346 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-gh-app-id_D56D9346" {
      ~ created_at       = "2026-01-11 15:27:23 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:27:23 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_A8AAD092 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_A8AAD092" {
      ~ created_at       = "2026-01-11 15:27:14 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:27:14 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-gh-app-private-key_1A5FE556 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-gh-app-private-key_1A5FE556" {
      ~ created_at       = "2026-01-11 15:26:57 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:26:57 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_FD3ABA72 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_FD3ABA72" {
      ~ created_at       = "2026-02-18 05:01:57 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:01:57 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_EDC8B29C must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_EDC8B29C" {
      ~ created_at       = "2026-02-18 05:01:55 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:01:55 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-gh-token_E88B7415 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-gh-token_E88B7415" {
      ~ created_at       = "2026-02-18 05:01:54 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-18 05:01:54 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-npm-token_DD40930E must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-npm-token_DD40930E" {
      ~ created_at       = "2026-02-08 02:51:40 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:51:40 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-twine-password_22A42B30 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-twine-password_22A42B30" {
      ~ created_at       = "2026-02-02 17:51:51 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-02 17:51:51 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-twine-username_BE540D6B must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-twine-username_BE540D6B" {
      ~ created_at       = "2026-01-11 15:26:55 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:26:55 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-external_repo_secret-alert-prs-slack-webhook-url_BB647440 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-external_repo_secret-alert-prs-slack-webhook-url_BB647440" {
      ~ created_at       = "2026-01-11 15:25:50 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-external:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:50 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-external_repo_secret-gh-app-id-alias-PROJEN_APP_ID_8D15D30D must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-external_repo_secret-gh-app-id-alias-PROJEN_APP_ID_8D15D30D" {
      ~ created_at       = "2026-01-11 15:26:24 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-external:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:26:24 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-external_repo_secret-gh-app-id_99E659EE must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-external_repo_secret-gh-app-id_99E659EE" {
      ~ created_at       = "2026-01-11...
```

</details>

*Pusher: @team-cdk-terrain[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*